# ImportIFCOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImportIFCOptions Class
Members See Also
---
Provides access to settings that control linking and opening IFC files.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class ImportIFCOptions : IDisposable
```

Visual Basic
---
```text
Public Class ImportIFCOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ImportIFCOptions : IDisposable
```

# Remarks
These settings are stored in the Revit.ini file. All documents in Revit instances which use this Revit.ini will follow these settings.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ImportIFCOptions
# See Also
ImportIFCOptions Members
Autodesk.Revit.DB Namespace